# 必要なライブラリを読み込み
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt


#各チームの本拠地の緯度の情報
dic_latitude = {
    '福岡': 33.585912,
    '新潟': 37.882127,
   # 'カターレ富山': 36.622605,
   # 'カマタマーレ讃岐': 34.261362,
   # 'ガイナーレ鳥取':35.458207,
    'G大阪':34.810366,
    'Ｇ大阪':34.810366,
    #'ギラヴァンツ北九州':33.890725,
    '札幌':43.007281,
    '鳥栖': 33.372503,
    '広島': 34.439938,
    #'ザスパクサツ群馬': 36.412692,
    '千葉':35.57820,
    '磐田': 34.725006,
    'C大阪':34.612245,
    'Ｃ大阪':34.612245,
    #'ファジアーノ岡山':34.679223,
    '仙台':38.319095,
    '山形':38.336331,
    #'ロアッソ熊本':32.837434,
    '甲府':35.621278,
    '神戸': 34.656755,
    '京都':34.993373,
    '名古屋':35.08437,
    '大分':33.200725,
    '大宮':35.916811,
    '川崎F':35.586617,
    '川崎Ｆ':35.586617,
    '徳島':34.167966,
   # '愛媛ＦＣ':33.76766,
    '東京V':35.663393,
    '松本':36.179336,
    '柏':35.84884,
    #'栃木ＳＣ':36.55658,
    '横浜FM':35.511092,
    '横浜FC':35.47078,
    #'水戸ホーリーホック':36.345421,
    '浦和':35.898223,
    '清水':34.985127,
    '湘南':35.342076,
    '鹿島':35.991994,
    #'ＦＣ岐阜':35.443224,
    'FC東京':35.663393,
    #'ＦＣ町田ゼルビア':35.591909,
    '長崎':32.837882
}

#各チームの本拠地の経度情報
dic_longtitude = {
    '福岡': 130.460178,
    '新潟': 139.058013,
   # 'カターレ富山': 137.197153,
   # 'カマタマーレ讃岐': 133.785271,
  #  'ガイナーレ鳥取': 134.220983,
    'G大阪': 135.54186,
    'Ｇ大阪': 135.54186,
     #'ギラヴァンツ北九州':130.729425,
    '札幌':141.411319,
    '鳥栖': 130.520319,
    '広島': 132.394889,
    #'ザスパクサツ群馬': 139.052248,
    '千葉':140.123481,
    '磐田': 137.878291,
    'C大阪': 135.517443,
    'Ｃ大阪': 135.517443,
    #'ファジアーノ岡山': 133.915391,
    '仙台': 140.881138,
    '山形':140.376203,
    #'ロアッソ熊本':130.799379,
    '甲府':138.588263,
    '神戸':135.169653,
    '京都': 135.715662,
    '名古屋':137.170306,
    '大分':131.658564,
    '大宮':139.629718,
    '川崎F':139.650662,
    '川崎Ｆ':139.650662,
    '徳島':134.61539,
    #'愛媛ＦＣ':132.796836,
    '東京V':139.525447,
    '松本': 137.916424,
    '柏':139.975654,
    #'栃木ＳＣ':139.985845,
    '横浜FM':139.6055,
    '横浜FC': 139.60297,
    #'水戸ホーリーホック':140.411733,
    '浦和':139.7088,
    '清水':138.48096,
    '湘南': 139.343132,
    '鹿島':140.640331,
    #'ＦＣ岐阜': 136.766525,
    'FC東京':139.525447,
    #'ＦＣ町田ゼルビア':139.438623,
    '長崎':130.040124
}


# 五大都市 札幌市、東京都区部、名古屋市、大阪市、福岡市 緯度情報
latitude_five_big_city = [
    35.689185,# 東京都区部
    34.693888,#大阪
    35.181422,#名古屋
    43.062107,#札幌
    33.590277,# 福岡
]
# 五大都市 札幌市、東京都区部、名古屋市、大阪市、福岡市 経度情報
longtitude_five_big_city = [
    139.691648,# 東京都区部
    135.501929,#大阪
    136.907184,#名古屋
    141.354168,#札幌
    130.401654,#福岡
]


population_five_big_city = [
    8945695,# 東京都区部
    2665314, #大阪
    2263894, #名古屋
    1913545, #札幌
    1463743, #福岡
]

def between_places(home_x, home_y, city_x, city_y):
    r = 6378.137 #地球の半径の定義
    d =  r*np.arccos(np.sin(np.deg2rad(home_y))*np.sin(np.deg2rad(city_y))+ \
                            np.cos(np.deg2rad(home_y))*np.cos(np.deg2rad(city_y))*np.cos(np.deg2rad(np.abs(city_x - home_x))))
    return d

def calc_distance(df):
    #２チーム間のホームスタジアムの距離間のリストを定義
    distance_list = []
    for i in range(len(df['home_team'])):
        #ホームチームの緯度と経度の情報を取得
        home_x  = dic_longtitude[df.iloc[i]['home_team']]
        home_y = dic_latitude[df.iloc[i]['home_team']]
        #アウェイチームの緯度と経度の情報を取得
        away_x = dic_longtitude[df.iloc[i]['away_team']]
        away_y = dic_latitude[df.iloc[i]['away_team']]

        d_with_weight =  between_places(home_x, home_y,longtitude_five_big_city[0], latitude_five_big_city[0])* population_five_big_city[0] + \
                         between_places(home_x, home_y,longtitude_five_big_city[1], latitude_five_big_city[1])* population_five_big_city[1] + \
                         between_places(home_x, home_y,longtitude_five_big_city[2], latitude_five_big_city[2])* population_five_big_city[2] + \
                         between_places(home_x, home_y,longtitude_five_big_city[3], latitude_five_big_city[3])* population_five_big_city[3] + \
                         between_places(home_x, home_y,longtitude_five_big_city[4], latitude_five_big_city[4])* population_five_big_city[4]



        #距離間のリストを定義
        distance_list.append(ｄ_with_weight)

    #pandasのデータフレームに変換
    df['distance_from_big_city'] = pd.DataFrame(distance_list)

    #欠損値を平均値で埋める
    df['distance_from_big_city'] = df['distance_from_big_city'].fillna(df['distance_from_big_city'].mean())
    return df

# Appendix
"""
def calc_time_from_station(df):
    df['time_from_station'] = df['stadium'].map(dic_from_station)
    return df




dic_shuttle_bus = {
    "うまかな・よかなスタジアム":40,1,
    "とりぎんバードスタジアム":1,1,
    "エコパスタジアム":15,0,
    "エディオンスタジアム広島":10,1,
    "キンチョウスタジアム":5,0,
    "ケーズデンキスタジアム水戸":98,0,
    "シティライトスタジアム":20,0,
    "デンカビッグスワンスタジアム":15,0,
    "ニッパツ三ツ沢球技場": 15,0,
    "ニンジニアスタジアム":83,1,
    "ノエビアスタジアム神戸": 5,0,
    "フクダ電子アリーナ":8,0,
    "ベストアメニティスタジアム":3,0,
    "ヤマハスタジアム（磐田)":41,1,
    "ヤンマースタジアム長居":6,0,
    "ユアテックスタジアム仙台":4,0,
    "レベルファイブスタジアム":23,1,
    "万博記念競技場":1,0,
    "京都市西京極総合運動公園陸上競技場兼球技場": 5,0,
    "佐賀県総合運動場陸上競技場":20,0,
    "北九州市立本城陸上競技場":23,1,
    "名古屋市瑞穂陸上競技場":5,0,
    "味の素スタジアム":5,1,
    "味の素フィールド西が丘":10,0,
    "国立競技場":1,0,
    "埼玉スタジアム２００２":15,1,
    "大分銀行ドーム":5,1,
    "大垣市浅中公園総合グラウンド陸上競技場":10,0,
    "宮城スタジアム":30,0,
    "富山県総合運動公園陸上競技場":119,0,
    "山梨中銀スタジアム":76,0,
    "岐阜メモリアルセンター長良川球技メドウ" 63,0,
    "岐阜メモリアルセンター長良川競技場"63,0,
    "岡山県津山陸上競技場":50,1,
    "日産スタジアム": 7,0,
    "日立柏サッカー場":20,0,
    "札幌ドーム":14,1,
    "札幌厚別公園競技場" 20,1,
    "松本平広域公園総合球技場":100,1,
    "栃木県グリーンスタジアム": 119,1,
    "正田醤油スタジアム群馬":40 ,1,
    "熊本市水前寺競技場":10,0,
    "熊谷スポーツ文化公園陸上競技場":50,0,
    "町田市立陸上競技場"100,1,
    "県立カシマサッカースタジアム":2,1,
    "神戸総合運動公園ユニバー記念競技場":7,0,
    "福島県営あづま陸上競技場":133,1,
    "等々力陸上競技場":15,1,
    "豊田スタジアム":15,0,
    "長崎市総合運動公園かきどまり陸上競技場":75,0,
    "長崎県立総合運動公園陸上競技場"30,0,
    "香川県立丸亀競技場":20,1,
    "駒沢オリンピック公園総合運動場陸上競技場":15,0,
    "鳴門・大塚スポーツパーク　ポカリスエットスタジアム":25,1,
    "鹿児島県立鴨池陸上競技場":1,0,
    "ＩＡＩスタジアム日本平":72,0,
    "ＮＡＣＫ５スタジアム大宮":20,0,
    "ＮＤソフトスタジアム山形":20,1,
    "Ｓｈｏｎａｎ　ＢＭＷスタジアム平塚":25,1
}
"""
